benchmarks/output/20260816T141050Z/baseline-none-c16-run1.txt
Running 30s test @ http://bench:3000/baseline
  4 threads and 16 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.06ms    4.14ms  49.88ms   94.77%
    Req/Sec    28.55k     4.81k   56.39k    81.75%
  Latency Distribution
     50%  128.00us
     75%  160.00us
     90%  326.00us
     99%   24.55ms
  3412014 requests in 30.05s, 208.25MB read
Requests/sec: 113558.66
Transfer/sec:      6.93MB
BENCHMARK_CSV,3412014,113558.66,128,6056,24552,0,0,0,0,0