benchmarks/output/20260816T141050Z/memory-many-c256-run2.txt
Running 30s test @ http://bench:3000/memory
  4 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.94ms    4.79ms 107.96ms   97.10%
    Req/Sec    13.94k     1.95k   26.00k    89.33%
  Latency Distribution
     50%    4.52ms
     75%    5.04ms
     90%    5.51ms
     99%   18.55ms
  1665121 requests in 30.05s, 266.78MB read
Requests/sec:  55411.60
Transfer/sec:      8.88MB
BENCHMARK_CSV,1665121,55411.60,4523,5777,18549,0,0,0,0,0