benchmarks/output/20260816T141050Z/redis-hot-c64-run2.txt
Running 30s test @ http://bench:3000/redis
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.03ms  224.28us   5.12ms   77.96%
    Req/Sec    15.55k   746.82    19.69k    88.62%
  Latency Distribution
     50%    0.99ms
     75%    1.11ms
     90%    1.32ms
     99%    1.66ms
  1862671 requests in 30.10s, 298.43MB read
Requests/sec:  61881.86
Transfer/sec:      9.91MB
BENCHMARK_CSV,1862671,61881.86,990,1444,1662,0,0,0,0,0